app/views/periods/index.html.haml

SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ?  [["period_id", 3]]
---
      - if period.current_period
        - period.subjects.each do |subject|

UPDATE "subjects" SET "grade" = ?, "value" = ?, "updated_at" = ? WHERE "subjects"."id" = 5  [["grade", 0], ["value", 0], ["updated_at", Thu, 16 Jan 2014 17:15:27 UTC +00:00]]
---
  for(var i = 0; i < gon.subjects.length; i++){
   subjectNames.push(gon.subjects[i].name)