app/views/subjects/index.html.haml

SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ?  [["period_id", 1]]
---
%br
-if @period.subjects.count >= 1