app/views/subjects/show.html.haml


  var subjectPercentage = Math.round( (gon.subject.grade / gon.subject.value)*100 );
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", "1"]]