app/controllers/periods_controller.rb

SELECT "periods".* FROM "periods" WHERE "periods"."user_id" = ?  [[nil, 1]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ?  [["period_id", 3]]
SELECT "tests".* FROM "tests" WHERE "tests"."subject_id" = ?  [[nil, 5]]
SELECT "projects".* FROM "projects" WHERE "projects"."subject_id" = ?  [["subject_id", 5]]
UPDATE "subjects" SET "grade" = ?, "value" = ?, "updated_at" = ? WHERE "subjects"."id" = 5  [["grade", 0], ["value", 0], ["updated_at", Thu, 16 Jan 2014 17:15:27 UTC +00:00]]
---
  def index
    @periods = current_user.periods
    @periods.each do |period|
      if period.current_period
        @period = period
        @subjects = period.subjects
      end
    end

    if @subjects
      @subjects.each do |subject|
        subject.grade = 0
        subject.value = 0
        subject.tests.each do |test|
          subject.grade += test.grade
          subject.value += test.value
        end
        subject.projects.each do |project|
          subject.grade += project.grade
          subject.value += project.value
        end
        subject.save

SELECT COUNT(*) FROM "periods" WHERE "periods"."current_period" = 't'
INSERT INTO "periods" ("created_at", "final_date", "init_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 17 Jan 2014 13:14:32 UTC +00:00], ["final_date", Fri, 17 Jan 2014], ["init_date", Fri, 17 Jan 2014], ["updated_at", Fri, 17 Jan 2014 13:14:32 UTC +00:00], ["user_id", 3]]
---
  def create
    @period = current_user.periods.new(period_params)

    if (Date.today >= @period.init_date) && (Date.today <= @period.final_date)
      @period.current_period = true
    else
      @period.current_period = false
    end

    #unless check_current_period(@period.current_period)
    if  @period.current_period && current_user.periods.where(current_period: true).count > 0
      render action: "new"
    else
      if @period.save

UPDATE "periods" SET "final_date" = ?, "updated_at" = ? WHERE "periods"."id" = 1  [["final_date", Mon, 20 Jan 2014], ["updated_at", Wed, 15 Jan 2014 12:13:17 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @period.current_period == true
        @period.current_period = false
      end
      if (Date.today >= @period.init_date) && (Date.today <= @period.final_date)
        @period.current_period = true
      end
      if @period.update(period_params)

DELETE FROM "periods" WHERE "periods"."id" = ?  [["id", 5]]
---
  def destroy
    @period.destroy

SELECT "periods".* FROM "periods" WHERE "periods"."user_id" = ? AND "periods"."id" = ? LIMIT 1  [["user_id", 3], ["id", "5"]]
---
    def set_period
      @period = current_user.periods.find(params[:id])