app/controllers/periods_controller.rb

SELECT "periods".* FROM "periods"
---
    def set_current_period
      @current_period = []
      @dados_periodo = {"period_number" => []}
      periods = current_user.periods
      periods.each do |period|