app/controllers/projects_controller.rb

  def index
    @projects = @subject.projects.all
---
SELECT "projects".* FROM "projects" WHERE "projects"."subject_id" = ?  [["subject_id", 3]]

  def create
    @project = @subject.projects.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "date", "grade", "note", "subject_id", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_project
      @period = Period.find(params[:period_id])
      @subject = @period.subjects.find(params[:subject_id])
      @project = @subject.projects.find(params[:id])
---
SELECT "periods".* FROM "periods" WHERE "periods"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ? AND "subjects"."id" = ? LIMIT 1  [["period_id", 2], ["id", "3"]]
SELECT "projects".* FROM "projects" WHERE "projects"."subject_id" = ? AND "projects"."id" = ? LIMIT 1  [["subject_id", 3], ["id", "3"]]