app/controllers/subjects_controller.rb

  def index
    @dados = Subject.get_period_and_subjects(@period)
    gon.subjects = @period.subjects.map &:attributes
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ?  [["period_id", 1]]

  def create
    @subject = @period.subjects.new(subject_params)

		if @subject.save
---
INSERT INTO "subjects" ("created_at", "name", "period_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 14 Jan 2014 18:38:40 UTC +00:00], ["name", "Cálculo "], ["period_id", 1], ["updated_at", Tue, 14 Jan 2014 18:38:40 UTC +00:00]]

    def set_subject
      @period = Period.find(params[:period_id])
      @subject = @period.subjects.find(params[:id])
---
SELECT "periods".* FROM "periods" WHERE "periods"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ? AND "subjects"."id" = ? LIMIT 1  [["period_id", 1], ["id", "3"]]