app/controllers/tests_controller.rb

  def index
    @tests = @subject.tests.all
---
SELECT "tests".* FROM "tests" WHERE "tests"."subject_id" = ?  [["subject_id", 2]]

  def create
    @test = @subject.tests.new(test_params)
    #@test.is_project = params[:test][:is_project]
    @test.subject_name = @subject.name
    #@test.is_project = params[:bool]
    if params[:commit] == "Salvar prova"
      @test.is_project = false
    elsif params[:commit] == "Salvar trabalho"
      @test.is_project = true
    end

    @subject.value += @test.value
    @subject.grade += @test.grade
    @subject.save
---
INSERT INTO "tests" ("created_at", "date", "note", "subject_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 28 Jan 2014 17:07:01 UTC +00:00], ["date", Tue, 28 Jan 2014 17:01:00 UTC +00:00], ["note", ""], ["subject_id", 1], ["updated_at", Tue, 28 Jan 2014 17:07:01 UTC +00:00]]

  def update
    #@test.is_project = params[:test][:is_project]
    if @test.is_project
      flash[:notice] = "Trabalho alterado com sucesso." if @test.save
    else
      flash[:notice] = "Prova alterada com sucesso." if @test.save
    end
    respond_with(@test, location: period_subject_path(@period, @subject))
    #respond_to do |format|
    #  if @test.update(test_params)
    #    format.html { redirect_to period_subject_path(@period, @subject), notice: 'Test was successfully updated.' }
    #    format.json { head :no_content }
    #  else
    #    format.html { render action: 'edit' }
    #    format.json { render json: @test.errors, status: :unprocessable_entity }
    #  end
    #end

    @subject.value = 0
    @subject.grade = 0

    @subject.tests.each do |test|
---
UPDATE "tests" SET "value" = ?, "grade" = ?, "updated_at" = ? WHERE "tests"."id" = 3  [["value", 3], ["grade", 5], ["updated_at", Tue, 28 Jan 2014 17:30:59 UTC +00:00]]
SELECT "tests".* FROM "tests" WHERE "tests"."subject_id" = ? AND "tests"."id" = ? LIMIT 1  [["subject_id", 2], ["id", "3"]]

    def set_test
      @period = Period.find(params[:period_id])
      @subject = @period.subjects.find(params[:subject_id])
      @test = @subject.tests.find(params[:id])
---
SELECT "periods".* FROM "periods" WHERE "periods"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."period_id" = ? AND "subjects"."id" = ? LIMIT 1  [["period_id", 1], ["id", "2"]]
SELECT "tests".* FROM "tests" WHERE "tests"."subject_id" = ? AND "tests"."id" = ? LIMIT 1  [["subject_id", 2], ["id", "3"]]